In [3]:
import pandas as pd
import numpy as np

In [9]:
df=pd.DataFrame(np.random.rand(334,5), index=np.arange(334))
df1={"Name":["Pavan","pavani","yogesh"],
     "Sex":["M","F","M"],
     "Marks":[100,110,50]
    
}

In [11]:
data=pd.DataFrame(df1)

In [12]:
data

     Name Sex  Marks
0   Pavan   M    100
1  pavani   F    110
2  yogesh   M     50

In [19]:
data.loc[[1],["Sex"]]

  Sex
1   F

In [105]:
df.head(5)

          0         1         2         3         4
0  0.785283  0.682234  0.289487  0.875670  0.715773
1   0.20173  0.367251  0.849425  0.083838  0.485253
2  0.330398  0.219359  0.180389  0.714272  0.034555
3  0.734181  0.025828  0.212320  0.648769  0.784168
4  0.856888  0.644217  0.155083  0.795347  0.284372

In [6]:
df.loc[[333],[0]]="siba"

C:\Users\pavan\AppData\Local\Temp\ipykernel_14452\2264022742.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'siba' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.loc[[333],[0]]="siba"

In [107]:
df.tail(2)

            0         1         2         3         4
332  0.990577  0.333547  0.467822  0.949119  0.199752
333      siba  0.098689  0.956402  0.682587  0.961135

In [108]:
df[0][333]

'siba'

In [7]:
df.tail(3)

            0         1         2         3         4
331  0.626125  0.703366  0.007981  0.109103  0.056424
332  0.513425  0.568479  0.060522  0.594541  0.353591
333      siba  0.255404  0.113910  0.830858  0.496152

In [109]:
df.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [110]:
df.columns

RangeIndex(start=0, stop=5, step=1)

In [119]:
df.to_numpy()

array([[0.07471106, 0.18475108, 0.24512611, 0.73605382, 0.8462296 ],
       [0.45632443, 0.95645097, 0.86503239, 0.12049898, 0.36208276],
       [0.24067323, 0.83916724, 0.32218581, 0.40828404, 0.47377764],
       ...,
       [0.96127971, 0.78812454, 0.80056423, 0.07150398, 0.2866383 ],
       [0.23307227, 0.18345276, 0.17085279, 0.22330742, 0.58271646],
       [0.35722469, 0.97922087, 0.57407166, 0.98337357, 0.76543382]])

In [118]:
df

            0         1         2         3         4
0    0.074711  0.184751  0.245126  0.736054  0.846230
1    0.456324  0.956451  0.865032  0.120499  0.362083
2    0.240673  0.839167  0.322186  0.408284  0.473778
3    0.489025  0.047429  0.060861  0.700402  0.552918
4    0.427410  0.107365  0.753621  0.898225  0.827463
..        ...       ...       ...       ...       ...
329  0.335668  0.790983  0.807358  0.616209  0.387721
330  0.905500  0.077560  0.027601  0.499491  0.589579
331  0.961280  0.788125  0.800564  0.071504  0.286638
332  0.233072  0.183453  0.170853  0.223307  0.582716
333  0.357225  0.979221  0.574072  0.983374  0.765434

[334 rows x 5 columns]

In [120]:
type(df)

pandas.core.frame.DataFrame

In [179]:
df.head()

          0         1         2         3         4
0  0.736152  0.968261  0.444183  0.332367  0.296220
1  0.199034  0.409356  0.705476  0.733176  0.691570
2  0.008146  0.749982  0.093362  0.129468  0.474763
3  0.341940  0.294000  0.805534  0.812826  0.039391
4  0.775285  0.692634  0.909390  0.826066  0.599017

In [135]:
df.sort_index(axis=1, ascending=False).sort_index(axis=0,ascending=True)

            4         3         2         1         0
0    0.846230  0.736054  0.245126  0.184751  0.074711
1    0.362083  0.120499  0.865032  0.956451  0.456324
2    0.473778  0.408284  0.322186  0.839167  0.240673
3    0.552918  0.700402  0.060861  0.047429  0.489025
4    0.827463  0.898225  0.753621  0.107365  0.427410
..        ...       ...       ...       ...       ...
329  0.387721  0.616209  0.807358  0.790983  0.335668
330  0.589579  0.499491  0.027601  0.077560  0.905500
331  0.286638  0.071504  0.800564  0.788125  0.961280
332  0.582716  0.223307  0.170853  0.183453  0.233072
333  0.765434  0.983374  0.574072  0.979221  0.357225

[334 rows x 5 columns]

In [136]:
type(df[0])

pandas.core.series.Series

In [137]:
type(df)

pandas.core.frame.DataFrame

In [180]:
df.head()

          0         1         2         3         4
0  0.736152  0.968261  0.444183  0.332367  0.296220
1  0.199034  0.409356  0.705476  0.733176  0.691570
2  0.008146  0.749982  0.093362  0.129468  0.474763
3  0.341940  0.294000  0.805534  0.812826  0.039391
4  0.775285  0.692634  0.909390  0.826066  0.599017

In [229]:

    df.loc[[5],:]=10

In [230]:
df.head(6)

      0          1          2          3          4
0  None   0.777058   0.861738   0.105043   0.589601
1  None   0.355065   0.508064   0.305498   0.095504
2  None   0.189542   0.453331   0.943215   0.356195
3  None   0.758604   0.632594   0.187695   0.871638
4  None   0.860924   0.671579   0.643952   0.716854
5    10  10.000000  10.000000  10.000000  10.000000

In [226]:
df

            0         1         2         3         4
0    0.884377  0.777058  0.861738  0.105043  0.589601
1    0.583132  0.355065  0.508064  0.305498  0.095504
2    0.205633  0.189542  0.453331  0.943215  0.356195
3    0.282920  0.758604  0.632594  0.187695  0.871638
4    0.209586  0.860924  0.671579  0.643952  0.716854
..        ...       ...       ...       ...       ...
329  0.176175  0.693780  0.398547  0.522760  0.414123
330  0.698700  0.408462  0.859656  0.544053  0.948357
331  0.025465  0.845953  0.606408  0.221652  0.395573
332  0.040020  0.583851  0.965152  0.051991  0.270318
333  0.001629  0.734099  0.583950  0.440281  0.161005

[334 rows x 5 columns]